<template>
  <div class="loading">
    <svg t="1591015666046" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5553" width="200" height="200"><path d="M512 322.56a35.84 35.84 0 0 1-35.84-35.84V102.4a35.84 35.84 0 1 1 71.68 0v184.32a35.84 35.84 0 0 1-35.84 35.84zM512 957.44a35.84 35.84 0 0 1-35.84-35.84v-184.32a35.84 35.84 0 1 1 71.68 0v184.32a35.84 35.84 0 0 1-35.84 35.84zM645.95456 378.04544a35.83488 35.83488 0 0 1 0-50.68288l130.33472-130.33472a35.83488 35.83488 0 0 1 50.68288 0 35.83488 35.83488 0 0 1 0 50.68288l-130.33472 130.33472a35.83488 35.83488 0 0 1-50.68288 0zM197.02784 826.97216a35.83488 35.83488 0 0 1 0-50.68288l130.33472-130.33472a35.83488 35.83488 0 0 1 50.68288 0 35.83488 35.83488 0 0 1 0 50.68288l-130.33472 130.33472a35.83488 35.83488 0 0 1-50.68288 0zM701.44 512a35.84 35.84 0 0 1 35.84-35.84h184.32a35.84 35.84 0 1 1 0 71.68h-184.32a35.84 35.84 0 0 1-35.84-35.84zM66.56 512a35.84 35.84 0 0 1 35.84-35.84h184.32a35.84 35.84 0 1 1 0 71.68H102.4a35.84 35.84 0 0 1-35.84-35.84zM645.95456 645.95456a35.83488 35.83488 0 0 1 50.68288 0l130.33472 130.33472a35.83488 35.83488 0 0 1 0 50.68288 35.83488 35.83488 0 0 1-50.68288 0l-130.33472-130.33472a35.83488 35.83488 0 0 1 0-50.68288zM197.02784 197.02784a35.83488 35.83488 0 0 1 50.68288 0l130.33472 130.33472a35.83488 35.83488 0 0 1 0 50.68288 35.83488 35.83488 0 0 1-50.68288 0L197.02784 247.71072a35.83488 35.83488 0 0 1 0-50.68288z" fill="#0000ff" p-id="5554"></path></svg>
  </div>
</template>

<script>
// 父组通过  :deta="data中的数据"  的方式将数据传递给子组件
//import myHead from "./head.vue"
export default {
   components: {
  },
  data() {
    return {
      name : '加载中'
    };
  },
  props: {
    //接收父组件传递过来的参数方法
    deta: {
      default: function() {
        return '';
      }
    }
  },
  beforeCreate(){
    //实例未创建，调用不到data数据
  },
  created() {
    //实例创建完成后调用,此阶段完成了数据的观测,可调用data数据
  },
   mounted() {
    //页面初始化方法
  },
  methods: {
    //定义方法的地方
    //监听方法click事件等，执行drawFeatures方法
  },
  
 
};
</script>

<style scoped>
.loading{
    position: fixed;
    width: 100%;
    height: 100%;
    top: 0;
    left: 0;
    background: rgba(250, 250, 250, .8);
    background-size: cover;
    z-index: 1000;
    display: flex;
    align-items: center;
    justify-content: center;
}
@keyframes star_rotate{
    0%   {transform:rotate(0deg);}
    100%   {transform:rotate(360deg);}
}
.loading svg{
    width: 60px;
    height: 60px;
    animation: star_rotate 2s linear infinite;
}
</style>
